Revit 2024 API
FabricationServiceSettings.HasValidFluidSetting Method
 Is the service associated with a fluid type and temperature?
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public bool HasValidFluidSetting(
	FabricationService service
)
Visual Basic
Public Function HasValidFluidSetting ( _
	service As FabricationService _
) As Boolean
Visual C++
public:
bool HasValidFluidSetting(
	FabricationService^ service
)
Parameters
service
Type: Autodesk.Revit.DB.FabricationService
 The service to lookup.
Return Value
 True if the service is associated with a fluid type and temperature, otherwise false.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FabricationServiceSettings Class
Autodesk.Revit.DB Namespace